БухЭксп/Catalogs/CW_DT_Сценарии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_DT_Сценарии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСценария</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_DT_ВидыСценария</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнить</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_DT_ВидыСценария.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_DT_ВидыСценария</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Значение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоискПоКоду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоискПоНаименованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоискПоНомеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗначениеИзСтрокиВнутр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_DT_Сценарии/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ВыполнитьСценарий(СтрокаПараметра) Экспорт
	Если		СтрокаПараметра.Сценарий.ВидСценария = Перечисления.CW_DT_ВидыСценария.ПоискПоНаименованию Тогда
		Справочник	= Метаданные.НайтиПоТипу(СтрокаПараметра.Параметр.ТипЗначения.Типы()[0]).Имя;
		Менеджер	= Справочники[Справочник];
		СтрокаПараметра.ЗначениеВПриемнике = Менеджер.НайтиПоНаименованию(СтрокаПараметра.Значение,Истина);
	ИначеЕсли	СтрокаПараметра.Сценарий.ВидСценария = Перечисления.CW_DT_ВидыСценария.ПоискПоКоду Тогда 
		Справочник	= Метаданные.НайтиПоТипу(СтрокаПараметра.Параметр.ТипЗначения.Типы()[0]).Имя;
		Менеджер	= Справочники[Справочник];
		СтрокаПараметра.ЗначениеВПриемнике = Менеджер.НайтиПоКоду(СтрокаПараметра.Значение,Истина);
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
